# CannotLoadMetricFamilyToImperialProject Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotLoadMetricFamilyToImperialProject Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't load a metric Family into an imperial Project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotLoadMetricFamilyToImperialProject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotLoadMetricFamilyToImperialProject As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotLoadMetricFamilyToImperialProject {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace